# Вывести первую букву каждого слова. Предполагается, что phrase уже определена

# Генератор списка для получения первых букв
first_letters = [word[0] for word in phrase.split()]

# Вывод результата на экран
print(first_letters)




