#Напишите программу, которая выведет все элементы арифметической прогрессии от 0 до 500 включительно с шагом 5.
for i in range(0,501,5):
    print(i)
